# Load Data
## Loading
- This notebook loads the trip data and taxi zone data into a SQL database

## Feature Engineering
- time: create hour and day of week features
- platforms: create platform variable (e.g. 'Uber', 'Lyft', etc)
- tips: indicator for whether a customer tipped
- driver pay metrics: pay per minute and pay per mile

In [1]:
import pandas as pd
import pyarrow.parquet as pq
%matplotlib inline
import os

In [2]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://root:root@localhost:5432/uber')
engine.connect()

%load_ext sql
%sql postgresql://root:root@localhost:5432/uber

In [3]:
%%sql
CREATE TABLE main;

 * postgresql://root:***@localhost:5432/uber
(psycopg2.errors.SyntaxError) syntax error at or near ";"
LINE 1: CREATE TABLE main;
                         ^

[SQL: CREATE TABLE main;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [4]:
for file in os.listdir('../data'):
    print(file)

.DS_Store
fhvhv_tripdata_2019-08.parquet
taxi_zones
taxi+_zone_lookup.csv
fhvhv_tripdata_2019-07.parquet
tableau_data.csv
taxi_zones.zip

In [5]:
fhvhv_datasets = [x for x in os.listdir('../data') if 'fhvhv' in x]
fhvhv_datasets

['fhvhv_tripdata_2019-08.parquet', 'fhvhv_tripdata_2019-07.parquet']

### Uber Data

In [6]:
%%sql
DROP TABLE IF EXISTS main;

 * postgresql://root:***@localhost:5432/uber
Done.

[]

In [ ]:
# limit sample size to keep things sane on local computer
sample_size = 500000

for dataset in fhvhv_datasets:
    df = pd.read_parquet('../data/'+dataset)
    # option to sample dataframe if need smaller loading time
    #df = df.sample(sample_size) 
    df.to_sql(name='main', con=engine, if_exists='append')

In [7]:
# alternative method using iter_batches if have many files
for dataset in fhvhv_datasets:
    parquet_file = pq.ParquetFile('../data/' + dataset)
    for batch in parquet_file.iter_batches(batch_size=64000):
        df = batch.to_pandas()
        #df = pd.read_parquet('../data/' + dataset)
        #df = df.sample(sample_size)
        df.to_sql(name='main', con=engine, if_exists='append')

In [8]:
%%sql
SELECT 
COUNT(*) num_observations
FROM main;

 * postgresql://root:***@localhost:5432/uber
1 rows affected.

[(40429425,)]

In [9]:
%%sql
SELECT 
MIN(request_datetime) ,
MAX(request_datetime) 
FROM 
main;

 * postgresql://root:***@localhost:5432/uber
1 rows affected.

[(datetime.datetime(2019, 6, 30, 22, 23, 25), datetime.datetime(2019, 8, 31, 23, 59, 15))]

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15312 entries, 0 to 15311
Data columns (total 24 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   hvfhs_license_num     15312 non-null  object
 1   dispatching_base_num  15312 non-null  object
 2   originating_base_num  10199 non-null  object
 3   request_datetime      15312 non-null  datetime64[us]
 4   on_scene_datetime     10199 non-null  datetime64[us]
 5   pickup_datetime       15312 non-null  datetime64[us]
 6   dropoff_datetime      15312 non-null  datetime64[us]
 7   PULocationID          15312 non-null  int64
 8   DOLocationID          15312 non-null  int64
 9   trip_miles            15312 non-null  float64
 10  trip_time             15312 non-null  int64
 11  base_passenger_fare   15312 non-null  float64
 12  tolls                 15312 non-null  float64
 13  bcf                   15312 non-null  float64
 14  sales_tax             15312 non-null  float64
 15  congestion_surcharge  15312 non-null  float64
 16  airport_fee           0 non-null      float64
 17  tips                  15312 non-null  float64
 18  driver_pay            15312 non-null  float64
 19  shared_request_flag   15312 non-null  object
 20  shared_match_flag     15312 non-null  object
 21  access_a_ride_flag    15312 non-null  object
 22  wav_request_flag      15312 non-null  object
 23  wav_match_flag        15312 non-null  object
dtypes: datetime64[us](4), float64(9), int64(3), object(8)
memory usage: 2.8+ MB

### Taxi Zones

In [11]:
taxi_zones = pd.read_csv('../data/taxi+_zone_lookup.csv')
taxi_zones.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 265 entries, 0 to 264
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   LocationID    265 non-null    int64
 1   Borough       265 non-null    object
 2   Zone          264 non-null    object
 3   service_zone  263 non-null    object
dtypes: int64(1), object(3)
memory usage: 8.4+ KB

In [12]:
taxi_zones

     LocationID        Borough                     Zone service_zone
0             1            EWR           Newark Airport          EWR
1             2         Queens              Jamaica Bay    Boro Zone
2             3          Bronx  Allerton/Pelham Gardens    Boro Zone
3             4      Manhattan            Alphabet City  Yellow Zone
4             5  Staten Island            Arden Heights    Boro Zone
..          ...            ...                      ...          ...
260         261      Manhattan       World Trade Center  Yellow Zone
261         262      Manhattan           Yorkville East  Yellow Zone
262         263      Manhattan           Yorkville West  Yellow Zone
263         264        Unknown                       NV          NaN
264         265        Unknown                      NaN          NaN

[265 rows x 4 columns]

In [13]:
taxi_zones.to_sql(name='zones', con=engine, if_exists='replace')

265

In [14]:
%%sql
DELETE FROM zones 
WHERE service_zone IS NULL;

 * postgresql://root:***@localhost:5432/uber
2 rows affected.

[]

### Main

In [15]:
%%sql
-- basic query
SELECT * FROM main LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
10 rows affected.

[(0, 'HV0003', 'B02682', 'B02682', datetime.datetime(2019, 8, 1, 0, 55, 56), datetime.datetime(2019, 8, 1, 0, 58, 7), datetime.datetime(2019, 8, 1, 0, 59, 31), datetime.datetime(2019, 8, 1, 1, 1, 47), 161, 163, 0.19, 137, 0.0, 0.0, 0.0, 0.0, 0.0, None, 0.0, 0.0, 'N', 'N', ' ', 'N', 'N'),
 (1, 'HV0003', 'B02682', 'B02682', datetime.datetime(2019, 8, 1, 0, 23, 43), datetime.datetime(2019, 8, 1, 0, 23, 53), datetime.datetime(2019, 8, 1, 0, 25, 5), datetime.datetime(2019, 8, 1, 0, 43, 36), 229, 244, 7.92, 1111, 0.0, 0.0, 0.0, 0.0, 0.0, None, 0.0, 0.0, 'N', 'N', ' ', 'N', 'N'),
 (2, 'HV0003', 'B02764', 'B02764', datetime.datetime(2019, 8, 1, 0, 22, 18), datetime.datetime(2019, 8, 1, 0, 22, 38), datetime.datetime(2019, 8, 1, 0, 24, 35), datetime.datetime(2019, 8, 1, 0, 31, 22), 161, 142, 1.39, 407, 0.0, 0.0, 0.0, 0.0, 0.0, None, 0.0, 0.0, 'N', 'N', ' ', 'N', 'N'),
 (3, 'HV0003', 'B02764', 'B02764', datetime.datetime(2019, 8, 1, 0, 40, 16), datetime.datetime(2019, 8, 1, 0, 37, 24), datetime.datetime(2019, 8, 1, 0, 40, 33), datetime.datetime(2019, 8, 1, 1, 13, 19), 163, 181, 10.47, 1854, 0.0, 0.0, 0.0, 0.0, 0.0, None, 0.0, 0.0, 'N', 'N', ' ', 'N', 'N'),
 (4, 'HV0003', 'B02864', 'B02864', datetime.datetime(2019, 7, 31, 23, 59, 3), datetime.datetime(2019, 8, 1, 0, 5, 11), datetime.datetime(2019, 8, 1, 0, 5, 11), datetime.datetime(2019, 8, 1, 0, 37, 8), 138, 123, 18.35, 1918, 0.0, 0.0, 0.0, 0.0, 0.0, None, 0.0, 0.0, 'N', 'N', ' ', 'N', 'N'),
 (5, 'HV0003', 'B02864', 'B02864', datetime.datetime(2019, 8, 1, 0, 40, 45), datetime.datetime(2019, 8, 1, 0, 41, 59), datetime.datetime(2019, 8, 1, 0, 43, 7), datetime.datetime(2019, 8, 1, 0, 50, 50), 149, 210, 2.06, 463, 0.0, 0.0, 0.0, 0.0, 0.0, None, 0.0, 0.0, 'N', 'N', ' ', 'N', 'N'),
 (6, 'HV0003', 'B02764', 'B02764', datetime.datetime(2019, 8, 1, 0, 25, 18), datetime.datetime(2019, 8, 1, 0, 26, 8), datetime.datetime(2019, 8, 1, 0, 28, 25), datetime.datetime(2019, 8, 1, 0, 34, 2), 255, 112, 1.15, 337, 0.0, 0.0, 0.0, 0.0, 0.0, None, 0.0, 0.0, 'N', 'N', ' ', 'N', 'N'),
 (7, 'HV0003', 'B02682', 'B02682', datetime.datetime(2019, 8, 1, 0, 7, 9), datetime.datetime(2019, 8, 1, 0, 7, 24), datetime.datetime(2019, 8, 1, 0, 12, 27), datetime.datetime(2019, 8, 1, 0, 26, 36), 246, 230, 2.17, 849, 0.0, 0.0, 0.0, 0.0, 0.0, None, 0.0, 0.0, 'N', 'N', ' ', 'N', 'N'),
 (8, 'HV0003', 'B02682', 'B02682', datetime.datetime(2019, 8, 1, 0, 54, 5), datetime.datetime(2019, 8, 1, 0, 54, 12), datetime.datetime(2019, 8, 1, 0, 57, 44), datetime.datetime(2019, 8, 1, 1, 15, 31), 162, 148, 4.4, 1066, 0.0, 0.0, 0.0, 0.0, 0.0, None, 0.0, 0.0, 'N', 'N', ' ', 'N', 'N'),
 (9, 'HV0003', 'B02872', 'B02872', datetime.datetime(2019, 8, 1, 0, 9, 18), datetime.datetime(2019, 8, 1, 0, 11, 1), datetime.datetime(2019, 8, 1, 0, 12, 41), datetime.datetime(2019, 8, 1, 0, 38, 5), 177, 148, 6.62, 1524, 0.0, 0.0, 0.0, 0.0, 0.0, None, 0.0, 0.0, 'N', 'N', ' ', 'N', 'N')]

### Hour and Day of Week

In [16]:
%%sql
ALTER TABLE main
ADD pickup_hour INT;

UPDATE main
SET pickup_hour = CAST(EXTRACT(hour FROM pickup_datetime) AS int)

 * postgresql://root:***@localhost:5432/uber
Done.
40429425 rows affected.

[]

In [17]:
%%sql
ALTER TABLE main
ADD pickup_dayofweek varchar(15);

ALTER TABLE main
ADD pickup_dayofweek_int INT;

UPDATE main 
SET pickup_dayofweek_int = CAST(
        EXTRACT(isodow FROM pickup_datetime) 
    AS INT);

UPDATE main 
SET pickup_dayofweek = 
CASE 
    WHEN pickup_dayofweek_int = 1 THEN 'Monday'
    WHEN pickup_dayofweek_int = 2 THEN 'Tuesday'
    WHEN pickup_dayofweek_int = 3 THEN 'Wednesday'
    WHEN pickup_dayofweek_int = 4 THEN 'Thursday'
    WHEN pickup_dayofweek_int = 5 THEN 'Friday'
    WHEN pickup_dayofweek_int = 6 THEN 'Saturday'
    WHEN pickup_dayofweek_int = 7 THEN 'Sunday'
END;

 * postgresql://root:***@localhost:5432/uber
Done.
Done.
40429425 rows affected.
40429425 rows affected.

[]

In [18]:
%%sql
ALTER TABLE main drop pickup_dayofweek_int;

 * postgresql://root:***@localhost:5432/uber
Done.

[]

### Platforms

In [19]:
%%sql
ALTER TABLE main 
ADD platform varchar(10);

UPDATE main 
SET platform = 
CASE 
    WHEN Hvfhs_license_num = 'HV0002' THEN 'Juno'
    WHEN Hvfhs_license_num = 'HV0003' THEN 'Uber'
    WHEN Hvfhs_license_num = 'HV0004' THEN 'Via'
    WHEN Hvfhs_license_num = 'HV0005' THEN 'Lyft'
END;

 * postgresql://root:***@localhost:5432/uber
Done.
40429425 rows affected.

[]

### Tips

In [20]:
%%sql
ALTER TABLE main 
ADD has_tips INT;

UPDATE main 
SET has_tips = CAST(tips > 0 AS INT);

 * postgresql://root:***@localhost:5432/uber
Done.
40429425 rows affected.

[]

### Driver Pay

In [21]:
%%sql
ALTER TABLE main 
ADD driver_pay_per_mile real DEFAULT NULL;

UPDATE main
SET driver_pay_per_mile = (driver_pay / trip_miles)::numeric
WHERE trip_miles > 0;

 * postgresql://root:***@localhost:5432/uber
Done.
40418180 rows affected.

[]

In [22]:
%%sql
ALTER TABLE main 
ADD driver_pay_per_minute real DEFAULT NULL;

UPDATE main
SET driver_pay_per_minute = (driver_pay / (trip_time/60.0))::numeric
WHERE trip_time > 0;

 * postgresql://root:***@localhost:5432/uber
Done.
40428818 rows affected.

[]